ErichStyger/mcuoneclipse/Examples/MCUXpresso/i.MX RT685-EVK/MIMXRT685_Blinky/drivers/fsl_power.c
    pmsk = __get_PRIMASK();

    if (vddCoreSrc == kVddCoreSrc_LDO)
    {
        __disable_irq();
    }

    /* Enter FBB mode first */
    if (POWER_GetBodyBiasMode(kCfg_Run) != kPmu_Fbb)
    {
        POWER_EnterFbb();
    }

    if (voltOpRange == kVoltOpLowRange)
    {
        cm33VoltIdx = POWER_CalcVoltLevel(&powerLowCm33FreqLevel[idx][0], 3U, cm33Freq, mini_volt);
        dspVoltIdx  = POWER_CalcVoltLevel(&powerLowDspFreqLevel[idx][0], 3U, dspFreq, mini_volt);
    }
    else
    {
        cm33VoltIdx = POWER_CalcVoltLevel(&powerFullCm33FreqLevel[idx][0], 5U, cm33Freq, mini_volt);
        dspVoltIdx  = POWER_CalcVoltLevel(&powerFullDspFreqLevel[idx][0], 5U, dspFreq, mini_volt);
    }
    voltIdx = MIN(cm33VoltIdx, dspVoltIdx);
    ret     = voltIdx < ARRAY_SIZE(powerLdoVoltLevel);

    if (ret)
    {
        if (powerLdoVoltLevel[voltIdx] < 0x13U) /* < 0.8V */
        {
            POWER_DisableLVD();
        }
        else
        {
            if (powerLdoVoltLevel[voltIdx] < 0x1DU) /* < 0.9V */
            {
                PMC_DECREASE_LVD_LEVEL_IF_HIGHER_THAN(kLvdFallingTripVol_795);
            }
            else if (powerLdoVoltLevel[voltIdx] < 0x26U) /* < 1.0V */
            {
                PMC_DECREASE_LVD_LEVEL_IF_HIGHER_THAN(kLvdFallingTripVol_885);
            }
            else
            {
                /* Do nothing */
            }
        }

        if (vddCoreSrc == kVddCoreSrc_LDO)
        {
            /* Configure vddcore voltage value */
            PMC->RUNCTRL = powerLdoVoltLevel[voltIdx];
            POWER_ApplyPD();
        }
        else
        {
            if (vddCoreSetCb != NULL)
            {
                /* Call PMIC callback function to set VDDCORE. */
                vddCoreSetCb(powerLdoMilliVolt[voltIdx]);
            }
            else
            {
                ret = false;
            }
        }

        if (powerLdoVoltLevel[voltIdx] >= 0x13U) /* >= 0.8V */
        {
            POWER_RestoreLVD();
        }
    }

    if (vddCoreSrc == kVddCoreSrc_LDO)
    {
        __set_PRIMASK(pmsk);
    }

    return ret;
}

void POWER_SetLvdFallingTripVoltage(power_lvd_falling_trip_vol_val_t volt)
{
    PMC->LVDCORECTRL = PMC_LVDCORECTRL_LVDCORELVL(volt);
    POWER_ApplyPD();
}

power_lvd_falling_trip_vol_val_t POWER_GetLvdFallingTripVoltage(void)
{
    return (power_lvd_falling_trip_vol_val_t)(uint32_t)((PMC->LVDCORECTRL & PMC_LVDCORECTRL_LVDCORELVL_MASK) >>
                                                        PMC_LVDCORECTRL_LVDCORELVL_SHIFT);
}

AT_QUICKACCESS_SECTION_CODE(static void delay(uint32_t count))
{
    uint32_t i = 0U;
    for (i = 0U; i < count; ++i)
    {
        __NOP();
    }
}

AT_QUICKACCESS_SECTION_CODE(static void deinitXip(void))
{
    if (IS_XIP_FLEXSPI())
    { /* FlexSPI */
        /* Wait until FLEXSPI is not busy */
        while (!(((FLEXSPI->STS0 & FLEXSPI_STS0_ARBIDLE_MASK) != 0U) &&
                 ((FLEXSPI->STS0 & FLEXSPI_STS0_SEQIDLE_MASK) != 0U)))
        {
        }
        /* Disable module. */
        FLEXSPI->MCR0 |= FLEXSPI_MCR0_MDIS_MASK;
        /* Disable clock. */
        CLKCTL0->PSCCTL0_CLR = CLKCTL0_PSCCTL0_CLR_FLEXSPI_OTFAD_CLK_MASK;
    }
}

AT_QUICKACCESS_SECTION_CODE(static void initFlexSPI(FLEXSPI_Type *base))
{
    uint32_t status;
    uint32_t lastStatus;
    uint32_t retry;
    uint32_t mask = 0;

    /* Enable FLEXSPI module */
    base->MCR0 &= ~FLEXSPI_MCR0_MDIS_MASK;

    base->MCR0 |= FLEXSPI_MCR0_SWRESET_MASK;
    while ((base->MCR0 & FLEXSPI_MCR0_SWRESET_MASK) != 0U)
    {
    }

    /* Need to wait DLL locked if DLL enabled */
    if (0U != (base->DLLCR[0] & FLEXSPI_DLLCR_DLLEN_MASK))
    {
        lastStatus = base->STS2;
        retry      = FLEXSPI_DLL_LOCK_RETRY;
        /* Flash on port A */
        if (((base->FLSHCR0[0] & FLEXSPI_FLSHCR0_FLSHSZ_MASK) > 0U) ||
            ((base->FLSHCR0[1] & FLEXSPI_FLSHCR0_FLSHSZ_MASK) > 0U))
        {
            mask |= FLEXSPI_STS2_AREFLOCK_MASK | FLEXSPI_STS2_ASLVLOCK_MASK;
        }
        /* Flash on port B */
        if (((base->FLSHCR0[2] & FLEXSPI_FLSHCR0_FLSHSZ_MASK) > 0U) ||
            ((base->FLSHCR0[3] & FLEXSPI_FLSHCR0_FLSHSZ_MASK) > 0U))
        {
            mask |= FLEXSPI_STS2_BREFLOCK_MASK | FLEXSPI_STS2_BSLVLOCK_MASK;
        }
        /* Wait slave delay line locked and slave reference delay line locked. */
        do
        {
            status = base->STS2;
            if ((status & mask) == mask)
            {
                /* Locked */
                retry = 100;
                break;
            }
            else if (status == lastStatus)
            {
                /* Same delay cell number in calibration */
                retry--;
            }
            else
            {
                retry      = FLEXSPI_DLL_LOCK_RETRY;
                lastStatus = status;
            }
        } while (retry > 0U);
        /* According to ERR011377, need to delay at least 100 NOPs to ensure the DLL is locked. */
        for (; retry > 0U; retry--)
        {
            __NOP();
        }
    }
}

AT_QUICKACCESS_SECTION_CODE(static void initXip(void))
{
    if (IS_XIP_FLEXSPI())
    { /* FlexSPI */
        /* Enable FLEXSPI clock again */
        CLKCTL0->PSCCTL0_SET = CLKCTL0_PSCCTL0_SET_FLEXSPI_OTFAD_CLK_MASK;
        /* Re-enable FLEXSPI module */
        initFlexSPI(FLEXSPI);
    }
}

AT_QUICKACCESS_SECTION_CODE(static uint32_t countPartitionSwitches(uint32_t numPerSwitch))
{
    (void)numPerSwitch;

    /* Find if there's memory is powered on in PDRUNCFGn but powered down in PDSLEEPCFGn */
    if ((((SYSCTL0->PDRUNCFG1 ^ SYSCTL0_PDRUNCFG1_MEM_BITS_MASK) &
          (SYSCTL0->PDSLEEPCFG1 & SYSCTL0_PDRUNCFG1_MEM_BITS_MASK)) != 0U) ||
        (((SYSCTL0->PDRUNCFG2 ^ SYSCTL0_PDRUNCFG2_BITS_MASK) & (SYSCTL0->PDSLEEPCFG2 & SYSCTL0_PDRUNCFG2_BITS_MASK)) !=
         0U) ||
        (((SYSCTL0->PDRUNCFG3 ^ SYSCTL0_PDRUNCFG3_BITS_MASK) & (SYSCTL0->PDSLEEPCFG3 & SYSCTL0_PDRUNCFG3_BITS_MASK)) !=
         0U))
    {
        /* All partitions are turned on in parallel */
        return 1U;
    }
    else
    {
        /* No partition power change */
        return 0U;
    };
}

AT_QUICKACCESS_SECTION_CODE(static uint32_t POWER_CalculateSafetyCount(void))
{
    uint32_t ns = 0U;
    bool flag;
    uint32_t temp, groups, switches;

